Обработки/Reports/_РасчетДоходностиРЕПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РасчетДоходностиРЕПО</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РасчетДоходностиРЕПО/Ext/ObjectModule.bsl
#Область Интерфейс_внешней_обработки

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Расчет доходности РЕПО",
		"0.2",
		"",
		Истина
	);
	
	// Команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	
	//РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ИмяКоманды", "Имя команды",, Ложь, "ВызовСерверногоМетода");
	
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
КонецФункции

#КонецОбласти

Процедура СформироватьОтчет(Результат, Расшифровка) Экспорт
	
	Результат.Очистить();	
	Расшифровка.Очистить();
	
#Область НачалоСбораСтатистики
	Механизм			= ЭтотОбъект.Метаданные().ПолноеИмя();
	ПараметрыСтатистики	= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект);	
	Сессия				= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыСтатистики.Хранилище, ПараметрыСтатистики.Описание); 
#КонецОбласти	
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация",	ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ДатаНачала",		ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",	ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ) КАК Дата
		|ПОМЕСТИТЬ _ОтчетныеДаты
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И ДанныеКалендаря.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, МЕСЯЦ) = КОНЕЦПЕРИОДА(ДанныеКалендаря.Дата, ДЕНЬ)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	КОНЕЦПЕРИОДА(&ДатаОкончания, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СделкаРЕПО.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _Сделки
		|ИЗ
		|	Документ.СделкаРЕПО КАК СделкаРЕПО
		|ГДЕ
		|	СделкаРЕПО.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И СделкаРЕПО.Проведен
		|	И СделкаРЕПО.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И СделкаРЕПО.ЧастьСделкиРЕПО <> 2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияСделокРЕПОСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО КАК СделкаРЕПО,
		|	УсловияСделокРЕПОСрезПоследних.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.ВидСделки КАК ВидСделки,
		|	УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата КАК ДатаОперации,
		|	НАЧАЛОПЕРИОДА(УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата, ДЕНЬ) КАК ДатаОперацииНачалоДня,
		|	УсловияСделокРЕПОСрезПоследних.ДатаОплаты КАК ДатаОплаты,
		|	УсловияСделокРЕПОСрезПоследних.Рынок КАК Рынок,
		|	УсловияСделокРЕПОСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
		|	УсловияСделокРЕПОСрезПоследних.Количество КАК Количество,
		|	УсловияСделокРЕПОСрезПоследних.Цена КАК Цена,
		|	УсловияСделокРЕПОСрезПоследних.ЦенаКупона КАК ЦенаКупона,
		|	УсловияСделокРЕПОСрезПоследних.Сумма + УсловияСделокРЕПОСрезПоследних.СуммаКупона КАК Сумма,
		|	УсловияСделокРЕПОСрезПоследних.СтавкаРЕПО КАК СтавкаРЕПО,
		|	УсловияСделокРЕПОСрезПоследних.ВалютаОплаты КАК ВалютаОплаты,
		|	ВЫБОР УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.ВидСделки
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|			ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ * ВЫБОР УсловияСделокРЕПОСрезПоследних.ЧастьСделкиРЕПО
		|		КОГДА 1
		|			ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ КАК ПризнакУменьшенияИлиУвеличенияИнвестиций,
		|	ВЫБОР УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.ВидСделки
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|			ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ * ВЫБОР УсловияСделокРЕПОСрезПоследних.ЧастьСделкиРЕПО
		|		КОГДА 1
		|			ТОГДА 1
		|		ИНАЧЕ -1
		|	КОНЕЦ * (УсловияСделокРЕПОСрезПоследних.Сумма + УсловияСделокРЕПОСрезПоследних.СуммаКупона) КАК СальдоПокупкиПродажи,
		|	РАЗНОСТЬДАТ(УсловияСделокРЕПОСрезПоследних.СделкаРЕПО.Дата, &ДатаОкончания, ДЕНЬ) / (РАЗНОСТЬДАТ(&ДатаНачала, &ДатаОкончания, ДЕНЬ) + 1) КАК ВременнойКоэффициент,
		|	РАЗНОСТЬДАТ(&ДатаНачала, &ДатаОкончания, ДЕНЬ) + 1 КАК КоличествоДнейВПериоде
		|ПОМЕСТИТЬ _УсловияСделок
		|ИЗ
		|	РегистрСведений.УсловияСделокРЕПО.СрезПоследних(
		|			&ДатаОкончания,
		|			Организация = &Организация
		|				И НЕ Отменено
		|				И СделкаРЕПО В
		|					(ВЫБРАТЬ
		|						_Сделки.Ссылка
		|					ИЗ
		|						_Сделки КАК _Сделки)) КАК УсловияСделокРЕПОСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_УсловияСделок.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_УсловияСделок.СчетДоверительногоУправления.КодСчета КАК КодСчета,
		|	_УсловияСделок.СделкаРЕПО КАК СделкаРЕПО,
		|	_УсловияСделок.ЧастьСделкиРЕПО КАК ЧастьСделкиРЕПО,
		|	_УсловияСделок.ВидСделки КАК ВидСделки,
		|	_УсловияСделок.ДатаОперации КАК ДатаОперации,
		|	_УсловияСделок.ДатаОплаты КАК ДатаОплаты,
		|	_УсловияСделок.Рынок КАК Рынок,
		|	_УсловияСделок.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЕСТЬNULL(Облигации.Эмитент, Акции.Эмитент) КАК Эмитент,
		|	ВЫБОР ТИПЗНАЧЕНИЯ(_УсловияСделок.ЦеннаяБумага)
		|		КОГДА ТИП(Справочник.Акции)
		|			ТОГДА Акции.Номинал
		|		КОГДА ТИП(Справочник.Облигации)
		|			ТОГДА НоминалыЦенныхБумаг.Номинал
		|	КОНЕЦ КАК Номинал,
		|	ВЫБОР ТИПЗНАЧЕНИЯ(_УсловияСделок.ЦеннаяБумага)
		|		КОГДА ТИП(Справочник.Акции)
		|			ТОГДА Акции.ГосударственныйРегистрационныйНомер
		|		КОГДА ТИП(Справочник.Облигации)
		|			ТОГДА Облигации.ГосударственныйРегистрационныйНомер
		|	КОНЕЦ КАК РегНомер,
		|	_УсловияСделок.Цена КАК Цена,
		|	_УсловияСделок.ЦенаКупона КАК ЦенаКупона,
		|	_УсловияСделок.Количество КАК Количество,
		|	_УсловияСделок.Сумма КАК Сумма,
		|	_УсловияСделок.СтавкаРЕПО КАК СтавкаРЕПО,
		|	_УсловияСделок.ВалютаОплаты КАК ВалютаОплаты,
		|	_УсловияСделок.ПризнакУменьшенияИлиУвеличенияИнвестиций КАК ПризнакУменьшенияИлиУвеличенияИнвестиций,
		|	_УсловияСделок.СальдоПокупкиПродажи КАК СальдоПокупкиПродажи,
		|	_УсловияСделок.ВременнойКоэффициент КАК ВременнойКоэффициент,
		|	_УсловияСделок.КоличествоДнейВПериоде КАК КоличествоДнейВПериоде,
		|	ЕСТЬNULL(РАЗНОСТЬДАТ(_УсловияСделок.ДатаОперации, _УсловияСделокВторойЧасти.ДатаОплаты, ДЕНЬ), 0) КАК КоличествоДней,
		|	ЕСТЬNULL(РАЗНОСТЬДАТ(_УсловияСделок.ДатаОперации, _УсловияСделокВторойЧасти.ДатаОплаты, ДЕНЬ), 0) * _УсловияСделок.СальдоПокупкиПродажи / _УсловияСделок.КоличествоДнейВПериоде КАК СуммаИнвестицийВзвешеннаяПоВремени,
		|	ВЫБОР _УсловияСделок.ВидСделки
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|			ТОГДА ""Продажа""
		|		ИНАЧЕ ""Покупка""
		|	КОНЕЦ + ВЫБОР _УсловияСделок.ЧастьСделкиРЕПО
		|		КОГДА 1
		|			ТОГДА "" (РЕПО)""
		|		ИНАЧЕ "" (РЕПО ч.2)""
		|	КОНЕЦ КАК ВидОперации
		|ПОМЕСТИТЬ _ДанныеРасшифровки
		|ИЗ
		|	_УсловияСделок КАК _УсловияСделок
		|		ЛЕВОЕ СОЕДИНЕНИЕ _УсловияСделок КАК _УсловияСделокВторойЧасти
		|		ПО _УсловияСделок.СделкаРЕПО = _УсловияСделокВторойЧасти.СделкаРЕПО
		|			И _УсловияСделок.ЦеннаяБумага = _УсловияСделокВторойЧасти.ЦеннаяБумага
		|			И (_УсловияСделок.ЧастьСделкиРЕПО = 1)
		|			И (_УсловияСделокВторойЧасти.ЧастьСделкиРЕПО = 2)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				_УсловияСделок.ЦеннаяБумага КАК ЦеннаяБумага,
		|				_УсловияСделок.ДатаОперацииНачалоДня КАК ДатаОперацииНачалоДня,
		|				МАКСИМУМ(НоминалыЦенныхБумаг.Период) КАК ПериодНоминала
		|			ИЗ
		|				_УсловияСделок КАК _УсловияСделок
		|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалыЦенныхБумаг КАК НоминалыЦенныхБумаг
		|					ПО _УсловияСделок.ЦеннаяБумага = НоминалыЦенныхБумаг.ЦеннаяБумага
		|						И _УсловияСделок.ДатаОперацииНачалоДня >= НоминалыЦенныхБумаг.Период
		|			
		|			СГРУППИРОВАТЬ ПО
		|				_УсловияСделок.ЦеннаяБумага,
		|				_УсловияСделок.ДатаОперацииНачалоДня) КАК НоминалыЦенныхБумагДаты
		|			ПО НоминалыЦенныхБумаг.ЦеннаяБумага = НоминалыЦенныхБумагДаты.ЦеннаяБумага
		|				И НоминалыЦенныхБумаг.Период = НоминалыЦенныхБумагДаты.ПериодНоминала
		|		ПО (_УсловияСделок.ЦеннаяБумага = НоминалыЦенныхБумагДаты.ЦеннаяБумага)
		|			И (_УсловияСделок.ДатаОперацииНачалоДня = НоминалыЦенныхБумагДаты.ДатаОперацииНачалоДня)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Акции КАК Акции
		|		ПО _УсловияСделок.ЦеннаяБумага = Акции.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|		ПО _УсловияСделок.ЦеннаяБумага = Облигации.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент,
		|	ВложенныйЗапрос.СчетДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	ВложенныйЗапрос.СчетДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	ВложенныйЗапрос.Дата КАК Дата,
		|	РАЗНОСТЬДАТ(&ДатаНачала, ВложенныйЗапрос.Дата, ДЕНЬ) + 1 КАК КоличествоДнейВПериоде,
		|	ВложенныйЗапрос.СальдоПокупкиПродажи КАК СальдоПокупкиПродажи,
		|	ВложенныйЗапрос.СуммаИнвестицийВзвешеннаяПоВремени КАК СуммаИнвестицийВзвешеннаяПоВремени,
		|	ВложенныйЗапрос.СальдоПокупкиПродажи / ВложенныйЗапрос.СуммаИнвестицийВзвешеннаяПоВремени * -1 * 365 * 100 / (РАЗНОСТЬДАТ(&ДатаНачала, ВложенныйЗапрос.Дата, ДЕНЬ) + 1) КАК Доходность,
		|	КОНЕЦПЕРИОДА(ВложенныйЗапрос.Дата, МЕСЯЦ) = КОНЕЦПЕРИОДА(ВложенныйЗапрос.Дата, ДЕНЬ) КАК КонецМесяца
		|ПОМЕСТИТЬ _Данные
		|ИЗ
		|	(ВЫБРАТЬ
		|		_ДанныеРасшифровки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		_ОтчетныеДаты.Дата КАК Дата,
		|		СУММА(_ДанныеРасшифровки.СальдоПокупкиПродажи) КАК СальдоПокупкиПродажи,
		|		СУММА(_ДанныеРасшифровки.КоличествоДней * _ДанныеРасшифровки.СальдоПокупкиПродажи / (РАЗНОСТЬДАТ(&ДатаНачала, _ОтчетныеДаты.Дата, ДЕНЬ) + 1)) КАК СуммаИнвестицийВзвешеннаяПоВремени
		|	ИЗ
		|		_ОтчетныеДаты КАК _ОтчетныеДаты
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ДанныеРасшифровки КАК _ДанныеРасшифровки
		|			ПО (_ДанныеРасшифровки.ДатаОперации МЕЖДУ &ДатаНачала И _ОтчетныеДаты.Дата)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		_ДанныеРасшифровки.СчетДоверительногоУправления,
		|		_ОтчетныеДаты.Дата) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления";
#КонецОбласти	

	Запрос.Выполнить();
	
	Данные = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос, "_Данные",,,, "Дата").Выгрузить();
	
	Если Данные.Количество() > 0 Тогда
		
		Макет = ПолучитьМакет("Отчет");
		
		СтрокаДанных = Данные[Данные.Количество() - 1];
		
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапка.Параметры.Заполнить(ЭтотОбъект);
		ОбластьШапка.Параметры.Заполнить(СтрокаДанных);
		ОбластьШапка.Параметры.Договор = Строка(СтрокаДанных.НомерДоговора) + " от " + Формат(СтрокаДанных.ДатаЗаключения, "ДФ=dd.MM.yyyy");
		
		Результат.Вывести(ОбластьШапка);
		
		Результат.Вывести(Макет.ПолучитьОбласть("ШапкаМесяц|КолонкаДоходность"));
		Для Каждого СтрокаДанных Из Данные Цикл
			Если СтрокаДанных.КонецМесяца Тогда
				ОбластьМесяц = Макет.ПолучитьОбласть("ШапкаМесяц|КолонкаМесяц");
				ОбластьМесяц.Параметры.Месяц = Формат(СтрокаДанных.Дата, "ДФ=MMMM");
				Результат.Присоединить(ОбластьМесяц);
			КонецЕсли;
		КонецЦикла;
		
		Результат.Вывести(Макет.ПолучитьОбласть("СтрокаМесяц|КолонкаДоходность"));
		Для Каждого СтрокаДанных Из Данные Цикл
			Если СтрокаДанных.КонецМесяца Тогда
				ОбластьМесяц = Макет.ПолучитьОбласть("СтрокаМесяц|КолонкаМесяц");
				ОбластьМесяц.Параметры.Заполнить(СтрокаДанных);
				Результат.Присоединить(ОбластьМесяц);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	ДанныеРасшифровки = СистемныеФункции.ПолучитьДанныеВременнойТаблицыЗапроса(Запрос, "_ДанныеРасшифровки",,,, "ДатаОперации").Выгрузить();
	Если ДанныеРасшифровки.Количество() > 0 Тогда
		
		Макет = ПолучитьМакет("Расшифровка");
		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		Расшифровка.Вывести(ОбластьШапка);
		
		Для Каждого СтрокаДанных Из ДанныеРасшифровки Цикл
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			ОбластьСтрока.Параметры.Заполнить(СтрокаДанных);
			Расшифровка.Вывести(ОбластьСтрока);
		КонецЦикла;
		
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	
	
КонецПроцедуры
